{
  "version": 1,
  "concepts": {
    "cadence.authentic.perfect": {
      "id": "cadence.authentic.perfect",
      "display_name": "Perfect Authentic Cadence (PAC)",
      "category": "cadential",
      "learning_levels": {
        "beginner": {
          "summary": "The strongest way to end a musical phrase - like a period at the end of a sentence. It uses V-I chords in root position with the melody ending on the home note, creating the most satisfying sense of resolution.",
          "key_points": [
            "Uses V → I chords (the most powerful progression)",
            "Both chords in strongest position (root position)",
            "Melody ends on the home note (scale degree 1)",
            "Creates the strongest sense of 'coming home'"
          ],
          "listen_for": "The satisfying 'resolved' feeling at phrase endings",
          "common_uses": [
            "Classical symphonies",
            "Hymn endings",
            "Final cadences in songs"
          ]
        },
        "intermediate": {
          "summary": "PAC combines three requirements for maximum closure strength",
          "key_points": [
            "V or V7 → I progression required",
            "Both chords must be in root position",
            "Soprano voice must end on tonic (^1)"
          ],
          "theory_deep_dive": {
            "requirements": [
              "V or V7 → I progression",
              "Both chords in root position",
              "Soprano voice ends on tonic (^1)"
            ],
            "why_strongest": [
              "Root position maximizes bass clarity",
              "Soprano ^1 provides melodic closure",
              "V-I progression fulfills dominant-tonic expectation"
            ]
          },
          "composition_tips": [
            "Use PAC for final cadences in pieces",
            "Reserve PAC for most important structural points",
            "Compare with IAC to create hierarchy of phrase endings"
          ]
        },
        "advanced": {
          "summary": "PAC as structural cornerstone in formal design",
          "theoretical_context": {
            "schenkerian_view": "PAC represents fundamental structure's bass arpeggiation I-V-I",
            "formal_function": "Essential punctuation for period structure",
            "historical_evolution": "Codified in Common Practice, weakened in Romantic era"
          },
          "analytical_considerations": [
            "Distinguishes authentic periods from sentences",
            "PAC elision creates continuous motion",
            "Delayed PAC builds dramatic tension"
          ],
          "related_patterns": [
            "Cadential 6/4 → V7 → I (expands PAC)",
            "Deceptive resolution (subverts PAC expectation)",
            "Extended PAC with pre-dominant chains"
          ]
        }
      },
      "musical_examples": {
        "progressions": [
          {
            "chords": "G C",
            "key": "C major",
            "roman_numerals": "V I",
            "context": "Simplest PAC",
            "visualization": {
              "chord_colors": [
                "D",
                "T"
              ],
              "bracket_range": {
                "start": 0,
                "end": 1
              }
            }
          }
        ],
        "repertoire": [
          {
            "composer": "Beethoven",
            "piece": "Symphony No. 5, mvt. 1",
            "location": "m. 21",
            "note": "Powerful PAC in Eb major"
          },
          {
            "composer": "Mozart",
            "piece": "Piano Sonata K. 545, mvt. 1",
            "location": "m. 4",
            "note": "Classic period ending with PAC"
          }
        ]
      },
      "relationships": {
        "contrasts_with": [
          "cadence.authentic.imperfect",
          "cadence.half",
          "cadence.deceptive"
        ],
        "builds_from": [
          "function.predominant",
          "function.dominant"
        ],
        "leads_to": [
          "phrase.new",
          "section.coda"
        ]
      },
      "misconceptions": [
        {
          "myth": "Any V-I is a PAC",
          "reality": "Must be root position with soprano on ^1",
          "clarification": "V6-I is IAC, not PAC, due to inversion. The bass and soprano positions matter just as much as the harmonic progression."
        }
      ],
      "practice_exercises": [
        "Identify PACs vs IACs in Bach chorales",
        "Compose parallel periods using PAC endings",
        "Analyze Haydn string quartets for PAC placement in formal structure"
      ],
      "explanation": {
        "hook": "Picture this: you're listening to a symphony, and suddenly—*there it is*—that unmistakable moment when everything clicks into place, the tension melts away, and the music feels complete. That's the Perfect Authentic Cadence, the strongest punctuation mark in all of Western music.",
        "breakdown": [
          "**The Three Non-Negotiables**: A PAC demands three things working together—first, the V-I harmonic progression (dominant resolving to tonic); second, both chords in root position (bass playing the root note); and third, the melody ending on scale degree 1 (the tonic note in the soprano voice).",
          "  - **Why root position matters**: When both chords have their roots in the bass, you get maximum clarity and stability—like a building with its foundation firmly on the ground, not teetering on upper floors.",
          "  - **Why the soprano's tonic matters**: The highest voice is what our ears track most closely. When it lands on the home note simultaneously with the harmonic resolution, you get a one-two punch of closure that's unmatched.",
          "**The Power Hierarchy**: Not all cadences are created equal. The PAC sits at the top of the cadential food chain—stronger than the Imperfect Authentic Cadence (which weakens closure through inversion or melodic displacement), miles ahead of the Half Cadence (which doesn't even try to resolve), and dramatically different from the Deceptive Cadence (which actively *avoids* resolution).",
          "**Functional Harmony in Action**: The V-I progression embodies the fundamental cycle of tonal music—dominant function (tension) resolving to tonic function (stability). This isn't just theory; it's the gravitational pull that's governed Western music for centuries."
        ],
        "story": "Let's travel back to the Classical period, when composers like Haydn and Mozart were writing symphonies for aristocratic audiences. Imagine you're in the audience at the premiere of Mozart's Symphony No. 40—you've just heard eight measures of the opening theme, with its restless energy and chromatic twists. Then, at measure 4, the music arrives at a PAC, and for just a moment, everything feels settled. But here's the genius: Mozart *knows* you're not satisfied yet. That PAC was just a checkpoint, not the destination.\n\nFast-forward through the movement, and when you finally reach the end of the exposition, there it is again—another PAC, but this time in the *new* key. Same formula (V-I, root position, soprano on tonic), different tonal center. The PAC isn't just an ending; it's a structural landmark that tells you, \"We've completed a formal unit here. Time to move forward.\"\n\nNow jump to the 20th century. Duke Ellington is at the piano, comping behind a saxophone solo. The changes? ii-V7-I, over and over—classic PAC material, just dressed up with jazz extensions and syncopation. Same harmonic foundation that Mozart used, same gravitational pull toward tonic, but now it's swinging at 140 BPM with a walking bass line. The PAC adapted, survived, and thrived across completely different musical worlds.",
        "composers": "**Beethoven** wielded PACs like punctuation in a dramatic argument—listen to Symphony No. 5, first movement, where the PAC at measure 21 arrives like a hammer blow after all that rising tension. **Mozart** used them to delineate formal structure with clockwork precision—his sonata expositions and recapitulations are practically *defined* by their strategic PAC placements. **Bach** embedded them in chorale harmonizations where they mark the ends of poetic lines, making the theology and the music align perfectly. In jazz, **Cole Porter** and **George Gershwin** built entire songs around chains of ii-V-I progressions, each one a mini-PAC waiting to resolve.",
        "examples": [
          "**Beethoven, Symphony No. 5, mvt. 1, m. 21**: The first PAC in Eb major after the famous opening motive—impossible to miss, like the period after an exclamation point.",
          "**Mozart, Piano Sonata K. 545, mvt. 1, m. 4**: Textbook PAC ending the opening four-bar phrase—this is what music theory teachers point to when they say \"perfect authentic cadence.\"",
          "**Bach, Chorale \"Jesu, Joy of Man's Desiring\", multiple locations**: Every phrase ends with either a PAC or an IAC, creating a rhythmic hierarchy of closure that matches the hymn text.",
          "**Gershwin, \"I Got Rhythm\", throughout**: Jazz standard built on repeating ii-V-I (PAC) turnarounds—you can't escape the pattern, and that's the point."
        ],
        "try_this": "**Composer's Challenge**: Take a simple four-bar melody you know (like \"Mary Had a Little Lamb\" or \"Twinkle Twinkle\") and harmonize it with a PAC at the end. First, identify where the melody ends—hopefully on the tonic note. Then work backward: place a V or V7 chord before the final I, making sure both are in root position. Finally, add a ii or IV chord before the V to complete the approach. Play it, and notice how *final* it feels compared to stopping anywhere else. That's the PAC doing its job—signaling \"this phrase is complete.\"",
        "technical_notes": {
          "voice_leading": "**The Mechanics**: In a four-part texture, the PAC requires careful voice leading to avoid parallel fifths and octaves between V and I. The leading tone (scale degree 7) in the V chord *must* resolve up to the tonic (scale degree 1)—this is non-negotiable in strict counterpoint. The chordal seventh in V7 (scale degree 4) typically resolves down to the third of the I chord (scale degree 3). When the soprano has the tonic at the cadence, the bass also has the tonic (root position requirement), which means you need to distribute the other chord tones (3 and 5) across the inner voices. Common-tone retention between chords (like holding the tonic note from V to I if it appears in an inner voice) helps smooth the resolution.",
          "theoretical_depth": "**Schenkerian Analysis**: From the perspective of Heinrich Schenker's theory of tonal structure, the PAC represents the surface manifestation of the *Ursatz* (fundamental structure)—the background progression from I through V back to I that governs all tonal pieces. Every PAC you hear is a small-scale replica of the large-scale tonal journey from stability through tension back to stability. The soprano's descent to scale degree 1 (*Urlinie* completion) combined with the bass's motion from V to I (*Bassbrechung*) creates what Schenker called \"structural closure\"—not just an ending, but the fulfillment of the tonal contract established at the piece's beginning.",
          "historical_context": "**Evolution Through History**: The PAC as we define it crystallized during the Classical period (1750-1820), but its roots go back to Baroque practice. Bach's chorales codified the V-I resolution as the standard phrase ending, though he often used inverted chords for smoother voice leading in inner phrases. By Mozart's time, theorists like Heinrich Christoph Koch were explicitly differentiating \"perfect\" from \"imperfect\" cadences based on bass position and soprano scale degree. The Romantic era (1820-1900) began to weaken cadential syntax—Chopin, Wagner, and Brahms used chromaticism and deceptive resolutions to undermine the PAC's finality. By the 20th century, Debussy and Stravinsky abandoned functional cadences altogether, though the PAC lived on in popular music and jazz, where its structural clarity remained essential."
        }
      }
    },
    "cadence.authentic.imperfect": {
      "id": "cadence.authentic.imperfect",
      "display_name": "Imperfect Authentic Cadence (IAC)",
      "category": "cadential",
      "learning_levels": {
        "beginner": {
          "summary": "A slightly weaker ending than PAC - still feels resolved but not as final",
          "key_points": [
            "Uses V → I like PAC, but with one difference",
            "Either a chord is inverted, OR the melody doesn't end on the home note",
            "Still sounds 'finished' but less strongly than PAC"
          ],
          "listen_for": "Resolution that feels complete but leaves room for continuation",
          "common_uses": [
            "Middle of pieces (not final endings)",
            "Question-answer phrases (answer part)",
            "Internal phrase endings"
          ]
        },
        "intermediate": {
          "summary": "IAC weakens PAC through inversion or soprano displacement",
          "key_points": [
            "V-I progression maintained",
            "Fails one PAC requirement: inversion OR soprano not on ^1",
            "Creates hierarchy of cadential strength"
          ],
          "theory_deep_dive": {
            "requirements": [
              "V or V7 → I progression",
              "At least one chord inverted OR soprano not on ^1"
            ],
            "types": [
              "Inverted IAC: V6-I or V-I6",
              "Melodic IAC: V-I with soprano on ^3 or ^5"
            ]
          },
          "composition_tips": [
            "Use for internal phrase endings",
            "Create contrast with stronger PAC later",
            "Employ in antecedent phrases before PAC consequent"
          ]
        },
        "advanced": {
          "summary": "IAC as tool for formal continuation and hierarchical structure",
          "theoretical_context": {
            "formal_function": "Enables continuation through weaker closure",
            "voice_leading": "Inverted bass provides smoother motion",
            "expressive_function": "Suggests incompleteness, forward momentum"
          },
          "analytical_considerations": [
            "IAC in antecedent enables period structure",
            "Differentiates sentence from period construction",
            "Allows modulation through weaker tonic confirmation"
          ],
          "related_patterns": [
            "Contrasts with PAC strength",
            "Often precedes PAC in period structure",
            "Can substitute for HC in some contexts"
          ]
        }
      },
      "musical_examples": {
        "progressions": [
          {
            "chords": "G C",
            "key": "C major",
            "roman_numerals": "V I",
            "context": "Simple IAC",
            "visualization": {
              "chord_colors": [
                "D",
                "T"
              ],
              "bracket_range": {
                "start": 0,
                "end": 1
              }
            }
          }
        ],
        "repertoire": [
          {
            "composer": "Mozart",
            "piece": "Eine Kleine Nachtmusik, mvt. 1",
            "location": "m. 8",
            "note": "IAC at antecedent ending"
          }
        ]
      },
      "relationships": {
        "contrasts_with": [
          "cadence.authentic.perfect"
        ],
        "builds_from": [
          "function.dominant"
        ],
        "leads_to": [
          "phrase.continuation",
          "cadence.authentic.perfect"
        ]
      },
      "misconceptions": [
        {
          "myth": "IAC is just a weak or failed PAC",
          "reality": "IAC serves distinct formal and expressive functions",
          "clarification": "Composers deliberately choose IAC for its continuation properties, not because they couldn't write PAC"
        }
      ],
      "practice_exercises": [
        "Compare IAC and PAC in Mozart sonata expositions",
        "Write period structures using IAC-PAC cadential pattern",
        "Identify types of IAC (inverted vs melodic) in repertoire"
      ]
    },
    "functional.ii_V_I": {
      "id": "functional.ii_V_I",
      "display_name": "ii-V-I Progression",
      "category": "functional",
      "learning_levels": {
        "beginner": {
          "summary": "The most fundamental progression in Western music - a complete journey home",
          "key_points": [
            "Moves through all three harmonic functions: PD → D → T",
            "ii chord 'sets up' the V chord",
            "V chord creates tension that resolves to I",
            "Foundation of countless songs across all genres"
          ],
          "listen_for": "The satisfying three-step journey to resolution",
          "common_uses": [
            "Jazz standards (with 7th chords: ii7-V7-I)",
            "Classical cadences",
            "Pop song endings"
          ]
        },
        "intermediate": {
          "summary": "Complete functional progression demonstrating T-PD-D-T harmonic cycle",
          "key_points": [
            "ii = predominant function (prepares dominant)",
            "V = dominant function (creates tension)",
            "I = tonic function (provides resolution)"
          ],
          "theory_deep_dive": {
            "voice_leading": [
              "Smooth voice leading: ii and V share scale degree 4",
              "Leading tone (7) resolves up to tonic (1)",
              "Root motion by 4th (ii→V) and 5th (V→I)"
            ],
            "extensions": [
              "Jazz: ii7-V7-Imaj7 with extended tertian harmony",
              "Minor: ii°-V-i with raised leading tone",
              "Substitutions: IV can replace ii, vi can replace I"
            ]
          },
          "composition_tips": [
            "Use ii7-V7-I for jazz flavor",
            "Try ii°6 in minor for smoother bass",
            "Extend with iii-vi-ii-V-I for longer phrases"
          ]
        },
        "advanced": {
          "summary": "Archetypal functional paradigm in tonal music theory",
          "theoretical_context": {
            "historical_development": "Crystallized in Classical period, extended in Romantic/Jazz",
            "theoretical_models": "Central to Riemann's functional theory",
            "jazz_theory": "Basis for ii-V substitutions and reharmonization"
          },
          "analytical_considerations": [
            "Can be prolonged through passing chords",
            "Subject to tritone substitution in jazz (bII7 for V7)",
            "Modal mixture allows ii-V-i in major contexts"
          ],
          "related_patterns": [
            "Circle of fifths: foundation pattern",
            "Ragtime progression: I-vi-ii-V",
            "Turnaround: vi-ii-V-I in jazz"
          ]
        }
      },
      "musical_examples": {
        "progressions": [
          {
            "chords": "Dm G7 C",
            "key": "C major",
            "roman_numerals": "ii V7 I",
            "context": "Classic ii-V-I",
            "visualization": {
              "chord_colors": [
                "PD",
                "D",
                "T"
              ],
              "bracket_range": {
                "start": 0,
                "end": 2
              }
            }
          }
        ],
        "repertoire": [
          {
            "composer": "George Gershwin",
            "piece": "I Got Rhythm",
            "location": "Throughout",
            "note": "Classic jazz ii-V-I turnarounds"
          },
          {
            "composer": "J.S. Bach",
            "piece": "Chorale: 'Jesu, Joy of Man's Desiring'",
            "location": "Multiple cadences",
            "note": "ii6-V-I bass motion"
          }
        ]
      },
      "relationships": {
        "contrasts_with": [
          "functional.I_IV_V",
          "modal.plagal"
        ],
        "builds_from": [
          "function.predominant",
          "function.dominant"
        ],
        "leads_to": [
          "extended.circle_of_fifths",
          "jazz.turnaround"
        ]
      },
      "misconceptions": [
        {
          "myth": "ii-V-I is only a jazz progression",
          "reality": "It's the fundamental cadential formula in all Western tonal music",
          "clarification": "Classical music uses ii-V-I extensively; jazz simply extended it with 7th chords and substitutions"
        }
      ],
      "practice_exercises": [
        "Play ii-V-I in all 12 keys",
        "Harmonize melodies using ii-V-I cadences",
        "Analyze jazz standards for ii-V-I occurrences and substitutions"
      ]
    },
    "cadence.half": {
      "id": "cadence.half",
      "display_name": "Half Cadence (HC)",
      "category": "cadential",
      "learning_levels": {
        "beginner": {
          "summary": "A pause point that creates expectation - like a comma instead of a period. Ends on the V chord, leaving the phrase feeling incomplete and wanting resolution.",
          "key_points": [
            "Ends on V chord (dominant)",
            "Creates a sense of pause without resolution",
            "Leaves listener expecting more music to follow",
            "Common at middle of phrases or before repeats"
          ],
          "listen_for": "The 'wait, there's more' feeling at phrase endings",
          "common_uses": [
            "Middle of contrasting periods",
            "Before repeat signs",
            "Creating forward momentum"
          ]
        }
      },
      "musical_examples": {
        "progressions": [
          {
            "chords": "F G",
            "key": "C major",
            "roman_numerals": "IV V",
            "context": "Common HC with predominant approach",
            "visualization": {
              "chord_colors": [
                "PD",
                "D"
              ],
              "bracket_range": {
                "start": 0,
                "end": 1
              }
            }
          }
        ]
      },
      "explanation": {
        "hook": "The Half Cadence is music's way of saying 'to be continued...'",
        "breakdown": [
          "**The Key Characteristic**: Unlike authentic cadences that resolve to I, the HC ends on V - creating expectation rather than closure.",
          "**Functional Purpose**: Acts as a structural pause point, keeping energy moving forward rather than bringing it to rest."
        ]
      }
    }
  },
  "pattern_families": {
    "cadential": {
      "overview": "Harmonic formulas that create closure or continuation in musical phrases",
      "hierarchy": [
        "PAC (strongest)",
        "IAC (strong)",
        "HC (weak, continuational)",
        "Deceptive (evaded)",
        "Plagal (alternative resolution)"
      ],
      "pedagogical_sequence": [
        "Start with V-I (both PAC and IAC)",
        "Add Half Cadence for contrast",
        "Introduce Deceptive for expressive effect",
        "Explore Plagal as alternative"
      ],
      "cross_references": {
        "formal_analysis": "Cadences define phrase boundaries and structural divisions",
        "voice_leading": "Soprano scale degree affects cadence strength",
        "harmony": "Functional harmony drives cadential motion"
      }
    },
    "functional": {
      "overview": "Progressions following the T-PD-D-T functional paradigm",
      "hierarchy": [
        "ii-V-I (complete cycle)",
        "IV-V-I (alternative PD)",
        "I-IV-V-I (extended)"
      ],
      "pedagogical_sequence": [
        "Master ii-V-I first",
        "Understand PD substitutions (ii vs IV)",
        "Explore circle of fifths extensions"
      ],
      "cross_references": {
        "jazz_harmony": "Basis for reharmonization and substitution",
        "classical_harmony": "Foundation of Common Practice Period"
      }
    }
  },
  "harmonic_functions": {
    "T": {
      "full_name": "Tonic Function",
      "musician_explanation": "Chords that sound stable and 'at home' - the point of rest in music",
      "common_chords": [
        "I",
        "vi (tonic substitute)",
        "iii (rare)"
      ],
      "role_in_music": "Provides stability, resolution, and establishes the key",
      "tension_level": "Low - feels resolved and at rest"
    },
    "D": {
      "full_name": "Dominant Function",
      "musician_explanation": "Chords that create tension wanting to resolve to tonic",
      "common_chords": [
        "V",
        "V7",
        "vii° (leading-tone chord)"
      ],
      "role_in_music": "Drives forward motion, creates harmonic tension, demands resolution",
      "tension_level": "High - strong pull toward tonic"
    },
    "PD": {
      "full_name": "Predominant Function",
      "musician_explanation": "Chords that prepare the dominant - the 'wind-up' before the tension",
      "common_chords": [
        "ii",
        "IV",
        "vi (sometimes)"
      ],
      "role_in_music": "Bridge from tonic to dominant, builds tension gradually",
      "tension_level": "Medium - moving toward dominant, preparing resolution"
    }
  }
}
